Klipper3d/klipper/src/atsamd/t5uid1/samd51_serial_pins.h
#ifndef __ATSAMD_T5UID1_SAMD51_SERIAL_PINS_H
#define __ATSAMD_T5UID1_SAMD51_SERIAL_PINS_H

#include "autoconf.h"
#include "../internal.h"

// RX definitions
#if CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA01
  #if CONFIG_ATSAMD51_SERIAL_RX_PA01 || CONFIG_ATSAMD51_SERIAL_TX_PA01
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 1)
  #define GPIO_Rx_NAME  "PA1"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA05
  #if CONFIG_ATSAMD51_SERIAL_RX_PA05 || CONFIG_ATSAMD51_SERIAL_TX_PA05
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 5)
  #define GPIO_Rx_NAME  "PA5"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA06
  #if CONFIG_ATSAMD51_SERIAL_RX_PA06 || CONFIG_ATSAMD51_SERIAL_TX_PA06
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 6)
  #define GPIO_Rx_NAME  "PA6"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA07
  #if CONFIG_ATSAMD51_SERIAL_RX_PA07 || CONFIG_ATSAMD51_SERIAL_TX_PA07
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 7)
  #define GPIO_Rx_NAME  "PA7"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA08
  #if CONFIG_ATSAMD51_SERIAL_RX_PA08 || CONFIG_ATSAMD51_SERIAL_TX_PA08
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 8)
  #define GPIO_Rx_NAME  "PA8"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA09
  #if CONFIG_ATSAMD51_SERIAL_RX_PA09 || CONFIG_ATSAMD51_SERIAL_TX_PA09
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 9)
  #define GPIO_Rx_NAME  "PA9"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA10
  #if CONFIG_ATSAMD51_SERIAL_RX_PA10 || CONFIG_ATSAMD51_SERIAL_TX_PA10
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 10)
  #define GPIO_Rx_NAME  "PA10"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA11
  #if CONFIG_ATSAMD51_SERIAL_RX_PA11 || CONFIG_ATSAMD51_SERIAL_TX_PA11
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 11)
  #define GPIO_Rx_NAME  "PA11"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA12
  #if CONFIG_ATSAMD51_SERIAL_RX_PA12 || CONFIG_ATSAMD51_SERIAL_TX_PA12
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 12)
  #define GPIO_Rx_NAME  "PA12"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA13
  #if CONFIG_ATSAMD51_SERIAL_RX_PA13 || CONFIG_ATSAMD51_SERIAL_TX_PA13
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 13)
  #define GPIO_Rx_NAME  "PA13"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA14
  #if CONFIG_ATSAMD51_SERIAL_RX_PA14 || CONFIG_ATSAMD51_SERIAL_TX_PA14
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 14)
  #define GPIO_Rx_NAME  "PA14"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA15
  #if CONFIG_ATSAMD51_SERIAL_RX_PA15 || CONFIG_ATSAMD51_SERIAL_TX_PA15
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 15)
  #define GPIO_Rx_NAME  "PA15"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA16
  #if CONFIG_ATSAMD51_SERIAL_RX_PA16 || CONFIG_ATSAMD51_SERIAL_TX_PA16
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 16)
  #define GPIO_Rx_NAME  "PA16"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA17
  #if CONFIG_ATSAMD51_SERIAL_RX_PA17 || CONFIG_ATSAMD51_SERIAL_TX_PA17
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 17)
  #define GPIO_Rx_NAME  "PA17"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA18
  #if CONFIG_ATSAMD51_SERIAL_RX_PA18 || CONFIG_ATSAMD51_SERIAL_TX_PA18
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 18)
  #define GPIO_Rx_NAME  "PA18"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA19
  #if CONFIG_ATSAMD51_SERIAL_RX_PA19 || CONFIG_ATSAMD51_SERIAL_TX_PA19
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 19)
  #define GPIO_Rx_NAME  "PA19"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA20
  #if CONFIG_ATSAMD51_SERIAL_RX_PA20 || CONFIG_ATSAMD51_SERIAL_TX_PA20
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 20)
  #define GPIO_Rx_NAME  "PA20"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA21
  #if CONFIG_ATSAMD51_SERIAL_RX_PA21 || CONFIG_ATSAMD51_SERIAL_TX_PA21
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 21)
  #define GPIO_Rx_NAME  "PA21"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA22
  #if CONFIG_ATSAMD51_SERIAL_RX_PA22 || CONFIG_ATSAMD51_SERIAL_TX_PA22
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 22)
  #define GPIO_Rx_NAME  "PA22"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA23
  #if CONFIG_ATSAMD51_SERIAL_RX_PA23 || CONFIG_ATSAMD51_SERIAL_TX_PA23
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 23)
  #define GPIO_Rx_NAME  "PA23"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA24
  #if CONFIG_ATSAMD51_SERIAL_RX_PA24 || CONFIG_ATSAMD51_SERIAL_TX_PA24 || CONFIG_USBSERIAL
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 24)
  #define GPIO_Rx_NAME  "PA24"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA25
  #if CONFIG_ATSAMD51_SERIAL_RX_PA25 || CONFIG_ATSAMD51_SERIAL_TX_PA25 || CONFIG_USBSERIAL
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 25)
  #define GPIO_Rx_NAME  "PA25"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA30
  #if CONFIG_ATSAMD51_SERIAL_RX_PA30 || CONFIG_ATSAMD51_SERIAL_TX_PA30
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('A', 30)
  #define GPIO_Rx_NAME  "PA30"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PA31
  #if CONFIG_ATSAMD51_SERIAL_RX_PA31 || CONFIG_ATSAMD51_SERIAL_TX_PA31
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

