Klipper3d/klipper/src/atsamd/t5uid1/samd51_serial_pins.h
  #define GPIO_Rx       GPIO('A', 31)
  #define GPIO_Rx_NAME  "PA31"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB00
  #if CONFIG_ATSAMD51_SERIAL_RX_PB00 || CONFIG_ATSAMD51_SERIAL_TX_PB00
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 0)
  #define GPIO_Rx_NAME  "PB0"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB01
  #if CONFIG_ATSAMD51_SERIAL_RX_PB01 || CONFIG_ATSAMD51_SERIAL_TX_PB01
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 1)
  #define GPIO_Rx_NAME  "PB1"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB03
  #if CONFIG_ATSAMD51_SERIAL_RX_PB03 || CONFIG_ATSAMD51_SERIAL_TX_PB03
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 3)
  #define GPIO_Rx_NAME  "PB3"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB09
  #if CONFIG_ATSAMD51_SERIAL_RX_PB09 || CONFIG_ATSAMD51_SERIAL_TX_PB09
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 9)
  #define GPIO_Rx_NAME  "PB9"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB10
  #if CONFIG_ATSAMD51_SERIAL_RX_PB10 || CONFIG_ATSAMD51_SERIAL_TX_PB10
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 10)
  #define GPIO_Rx_NAME  "PB10"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB11
  #if CONFIG_ATSAMD51_SERIAL_RX_PB11 || CONFIG_ATSAMD51_SERIAL_TX_PB11
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 11)
  #define GPIO_Rx_NAME  "PB11"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB13
  #if CONFIG_ATSAMD51_SERIAL_RX_PB13 || CONFIG_ATSAMD51_SERIAL_TX_PB13
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 13)
  #define GPIO_Rx_NAME  "PB13"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB14
  #if CONFIG_ATSAMD51_SERIAL_RX_PB14 || CONFIG_ATSAMD51_SERIAL_TX_PB14
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 14)
  #define GPIO_Rx_NAME  "PB14"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB15
  #if CONFIG_ATSAMD51_SERIAL_RX_PB15 || CONFIG_ATSAMD51_SERIAL_TX_PB15
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 15)
  #define GPIO_Rx_NAME  "PB15"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB17
  #if CONFIG_ATSAMD51_SERIAL_RX_PB17 || CONFIG_ATSAMD51_SERIAL_TX_PB17
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 17)
  #define GPIO_Rx_NAME  "PB17"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB18
  #if CONFIG_ATSAMD51_SERIAL_RX_PB18 || CONFIG_ATSAMD51_SERIAL_TX_PB18
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 18)
  #define GPIO_Rx_NAME  "PB18"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB19
  #if CONFIG_ATSAMD51_SERIAL_RX_PB19 || CONFIG_ATSAMD51_SERIAL_TX_PB19
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 19)
  #define GPIO_Rx_NAME  "PB19"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB20
  #if CONFIG_ATSAMD51_SERIAL_RX_PB20 || CONFIG_ATSAMD51_SERIAL_TX_PB20
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 20)
  #define GPIO_Rx_NAME  "PB20"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB21
  #if CONFIG_ATSAMD51_SERIAL_RX_PB21 || CONFIG_ATSAMD51_SERIAL_TX_PB21
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 21)
  #define GPIO_Rx_NAME  "PB21"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB22
  #if CONFIG_ATSAMD51_SERIAL_RX_PB22 || CONFIG_ATSAMD51_SERIAL_TX_PB22
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 22)
  #define GPIO_Rx_NAME  "PB22"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB23
  #if CONFIG_ATSAMD51_SERIAL_RX_PB23 || CONFIG_ATSAMD51_SERIAL_TX_PB23
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 23)
  #define GPIO_Rx_NAME  "PB23"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB24
  #if CONFIG_ATSAMD51_SERIAL_RX_PB24 || CONFIG_ATSAMD51_SERIAL_TX_PB24
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 24)
  #define GPIO_Rx_NAME  "PB24"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB25
  #if CONFIG_ATSAMD51_SERIAL_RX_PB25 || CONFIG_ATSAMD51_SERIAL_TX_PB25
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 25)
  #define GPIO_Rx_NAME  "PB25"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB26
  #if CONFIG_ATSAMD51_SERIAL_RX_PB26 || CONFIG_ATSAMD51_SERIAL_TX_PB26
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 26)
  #define GPIO_Rx_NAME  "PB26"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB27
  #if CONFIG_ATSAMD51_SERIAL_RX_PB27 || CONFIG_ATSAMD51_SERIAL_TX_PB27
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 27)
  #define GPIO_Rx_NAME  "PB27"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB28
  #if CONFIG_ATSAMD51_SERIAL_RX_PB28 || CONFIG_ATSAMD51_SERIAL_TX_PB28
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 28)
  #define GPIO_Rx_NAME  "PB28"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB29
  #if CONFIG_ATSAMD51_SERIAL_RX_PB29 || CONFIG_ATSAMD51_SERIAL_TX_PB29
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 29)
  #define GPIO_Rx_NAME  "PB29"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB30
  #if CONFIG_ATSAMD51_SERIAL_RX_PB30 || CONFIG_ATSAMD51_SERIAL_TX_PB30
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

