Klipper3d/klipper/src/atsamd/t5uid1/samd51_serial_pins.h
  #define GPIO_Rx       GPIO('B', 30)
  #define GPIO_Rx_NAME  "PB30"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PB31
  #if CONFIG_ATSAMD51_SERIAL_RX_PB31 || CONFIG_ATSAMD51_SERIAL_TX_PB31
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('B', 31)
  #define GPIO_Rx_NAME  "PB31"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC05
  #if CONFIG_ATSAMD51_SERIAL_RX_PC05 || CONFIG_ATSAMD51_SERIAL_TX_PC05
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 5)
  #define GPIO_Rx_NAME  "PC5"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC06
  #if CONFIG_ATSAMD51_SERIAL_RX_PC06 || CONFIG_ATSAMD51_SERIAL_TX_PC06
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 6)
  #define GPIO_Rx_NAME  "PC6"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC07
  #if CONFIG_ATSAMD51_SERIAL_RX_PC07 || CONFIG_ATSAMD51_SERIAL_TX_PC07
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 7)
  #define GPIO_Rx_NAME  "PC7"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC10
  #if CONFIG_ATSAMD51_SERIAL_RX_PC10 || CONFIG_ATSAMD51_SERIAL_TX_PC10
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 10)
  #define GPIO_Rx_NAME  "PC10"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC11
  #if CONFIG_ATSAMD51_SERIAL_RX_PC11 || CONFIG_ATSAMD51_SERIAL_TX_PC11
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 11)
  #define GPIO_Rx_NAME  "PC11"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC12
  #if CONFIG_ATSAMD51_SERIAL_RX_PC12 || CONFIG_ATSAMD51_SERIAL_TX_PC12
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 12)
  #define GPIO_Rx_NAME  "PC12"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC13
  #if CONFIG_ATSAMD51_SERIAL_RX_PC13 || CONFIG_ATSAMD51_SERIAL_TX_PC13
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 13)
  #define GPIO_Rx_NAME  "PC13"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC14
  #if CONFIG_ATSAMD51_SERIAL_RX_PC14 || CONFIG_ATSAMD51_SERIAL_TX_PC14
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 14)
  #define GPIO_Rx_NAME  "PC14"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC15
  #if CONFIG_ATSAMD51_SERIAL_RX_PC15 || CONFIG_ATSAMD51_SERIAL_TX_PC15
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 15)
  #define GPIO_Rx_NAME  "PC15"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC16
  #if CONFIG_ATSAMD51_SERIAL_RX_PC16 || CONFIG_ATSAMD51_SERIAL_TX_PC16
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 16)
  #define GPIO_Rx_NAME  "PC16"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC17
  #if CONFIG_ATSAMD51_SERIAL_RX_PC17 || CONFIG_ATSAMD51_SERIAL_TX_PC17
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 17)
  #define GPIO_Rx_NAME  "PC17"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC18
  #if CONFIG_ATSAMD51_SERIAL_RX_PC18 || CONFIG_ATSAMD51_SERIAL_TX_PC18
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 18)
  #define GPIO_Rx_NAME  "PC18"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC19
  #if CONFIG_ATSAMD51_SERIAL_RX_PC19 || CONFIG_ATSAMD51_SERIAL_TX_PC19
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 19)
  #define GPIO_Rx_NAME  "PC19"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC22
  #if CONFIG_ATSAMD51_SERIAL_RX_PC22 || CONFIG_ATSAMD51_SERIAL_TX_PC22
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 22)
  #define GPIO_Rx_NAME  "PC22"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC23
  #if CONFIG_ATSAMD51_SERIAL_RX_PC23 || CONFIG_ATSAMD51_SERIAL_TX_PC23
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 23)
  #define GPIO_Rx_NAME  "PC23"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC24
  #if CONFIG_ATSAMD51_SERIAL_RX_PC24 || CONFIG_ATSAMD51_SERIAL_TX_PC24
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 24)
  #define GPIO_Rx_NAME  "PC24"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC25
  #if CONFIG_ATSAMD51_SERIAL_RX_PC25 || CONFIG_ATSAMD51_SERIAL_TX_PC25
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 25)
  #define GPIO_Rx_NAME  "PC25"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PC28
  #if CONFIG_ATSAMD51_SERIAL_RX_PC28 || CONFIG_ATSAMD51_SERIAL_TX_PC28
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('C', 28)
  #define GPIO_Rx_NAME  "PC28"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PD08
  #if CONFIG_ATSAMD51_SERIAL_RX_PD08 || CONFIG_ATSAMD51_SERIAL_TX_PD08
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('D', 8)
  #define GPIO_Rx_NAME  "PD8"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PD09
  #if CONFIG_ATSAMD51_SERIAL_RX_PD09 || CONFIG_ATSAMD51_SERIAL_TX_PD09
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('D', 9)
  #define GPIO_Rx_NAME  "PD9"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PD10
  #if CONFIG_ATSAMD51_SERIAL_RX_PD10 || CONFIG_ATSAMD51_SERIAL_TX_PD10
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('D', 10)
  #define GPIO_Rx_NAME  "PD10"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PD11
  #if CONFIG_ATSAMD51_SERIAL_RX_PD11 || CONFIG_ATSAMD51_SERIAL_TX_PD11
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('D', 11)
  #define GPIO_Rx_NAME  "PD11"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PD20
  #if CONFIG_ATSAMD51_SERIAL_RX_PD20 || CONFIG_ATSAMD51_SERIAL_TX_PD20
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Rx       GPIO('D', 20)
  #define GPIO_Rx_NAME  "PD20"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_RX_PD21
  #if CONFIG_ATSAMD51_SERIAL_RX_PD21 || CONFIG_ATSAMD51_SERIAL_TX_PD21
    #error "The RX pin selected for the T5UID1 screen is already used"
  #endif

