Klipper3d/klipper/src/atsamd/t5uid1/samd51_serial_pins.h
  #define GPIO_Rx       GPIO('D', 21)
  #define GPIO_Rx_NAME  "PD21"
#endif

#if CONFIG_ATSAMD_T5UID1_SERIAL_RX_ALT
  #define GPIO_Rx_FUNC  'D'
#else
  #define GPIO_Rx_FUNC  'C'
#endif

#if CONFIG_ATSAMD_T5UID1_SERIAL_RX_PAD1
  #define GPIO_Rx_PINOUT  0x1
#elif CONFIG_ATSAMD_T5UID1_SERIAL_RX_PAD2
  #define GPIO_Rx_PINOUT  0x2
#elif CONFIG_ATSAMD_T5UID1_SERIAL_RX_PAD3
  #define GPIO_Rx_PINOUT  0x3
#endif

// TX definitions
#if CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PA00
  #if CONFIG_ATSAMD51_SERIAL_RX_PA00 || CONFIG_ATSAMD51_SERIAL_TX_PA00
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('A', 0)
  #define GPIO_Tx_NAME  "PA0"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PA04
  #if CONFIG_ATSAMD51_SERIAL_RX_PA04 || CONFIG_ATSAMD51_SERIAL_TX_PA04
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('A', 4)
  #define GPIO_Tx_NAME  "PA4"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PA08
  #if CONFIG_ATSAMD51_SERIAL_RX_PA08 || CONFIG_ATSAMD51_SERIAL_TX_PA08
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('A', 8)
  #define GPIO_Tx_NAME  "PA8"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PA09
  #if CONFIG_ATSAMD51_SERIAL_RX_PA09 || CONFIG_ATSAMD51_SERIAL_TX_PA09
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('A', 9)
  #define GPIO_Tx_NAME  "PA9"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PA12
  #if CONFIG_ATSAMD51_SERIAL_RX_PA12 || CONFIG_ATSAMD51_SERIAL_TX_PA12
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('A', 12)
  #define GPIO_Tx_NAME  "PA12"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PA13
  #if CONFIG_ATSAMD51_SERIAL_RX_PA13 || CONFIG_ATSAMD51_SERIAL_TX_PA13
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('A', 13)
  #define GPIO_Tx_NAME  "PA13"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PA16
  #if CONFIG_ATSAMD51_SERIAL_RX_PA16 || CONFIG_ATSAMD51_SERIAL_TX_PA16
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('A', 16)
  #define GPIO_Tx_NAME  "PA16"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PA17
  #if CONFIG_ATSAMD51_SERIAL_RX_PA17 || CONFIG_ATSAMD51_SERIAL_TX_PA17
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('A', 17)
  #define GPIO_Tx_NAME  "PA17"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PA22
  #if CONFIG_ATSAMD51_SERIAL_RX_PA22 || CONFIG_ATSAMD51_SERIAL_TX_PA22
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('A', 22)
  #define GPIO_Tx_NAME  "PA22"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PA23
  #if CONFIG_ATSAMD51_SERIAL_RX_PA23 || CONFIG_ATSAMD51_SERIAL_TX_PA23
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('A', 23)
  #define GPIO_Tx_NAME  "PA23"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PB02
  #if CONFIG_ATSAMD51_SERIAL_RX_PB02 || CONFIG_ATSAMD51_SERIAL_TX_PB02
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('B', 2)
  #define GPIO_Tx_NAME  "PB2"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PB08
  #if CONFIG_ATSAMD51_SERIAL_RX_PB08 || CONFIG_ATSAMD51_SERIAL_TX_PB08
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('B', 8)
  #define GPIO_Tx_NAME  "PB8"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PB12
  #if CONFIG_ATSAMD51_SERIAL_RX_PB12 || CONFIG_ATSAMD51_SERIAL_TX_PB12
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('B', 12)
  #define GPIO_Tx_NAME  "PB12"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PB16
  #if CONFIG_ATSAMD51_SERIAL_RX_PB16 || CONFIG_ATSAMD51_SERIAL_TX_PB16
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('B', 16)
  #define GPIO_Tx_NAME  "PB16"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PB20
  #if CONFIG_ATSAMD51_SERIAL_RX_PB20 || CONFIG_ATSAMD51_SERIAL_TX_PB20
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('B', 20)
  #define GPIO_Tx_NAME  "PB20"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PB21
  #if CONFIG_ATSAMD51_SERIAL_RX_PB21 || CONFIG_ATSAMD51_SERIAL_TX_PB21
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('B', 21)
  #define GPIO_Tx_NAME  "PB21"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PB24
  #if CONFIG_ATSAMD51_SERIAL_RX_PB24 || CONFIG_ATSAMD51_SERIAL_TX_PB24
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('B', 24)
  #define GPIO_Tx_NAME  "PB24"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PB25
  #if CONFIG_ATSAMD51_SERIAL_RX_PB25 || CONFIG_ATSAMD51_SERIAL_TX_PB25
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('B', 25)
  #define GPIO_Tx_NAME  "PB25"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PB26
  #if CONFIG_ATSAMD51_SERIAL_RX_PB26 || CONFIG_ATSAMD51_SERIAL_TX_PB26
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('B', 26)
  #define GPIO_Tx_NAME  "PB26"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PB27
  #if CONFIG_ATSAMD51_SERIAL_RX_PB27 || CONFIG_ATSAMD51_SERIAL_TX_PB27
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('B', 27)
  #define GPIO_Tx_NAME  "PB27"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PB30
  #if CONFIG_ATSAMD51_SERIAL_RX_PB30 || CONFIG_ATSAMD51_SERIAL_TX_PB30
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('B', 30)
  #define GPIO_Tx_NAME  "PB30"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PB31
  #if CONFIG_ATSAMD51_SERIAL_RX_PB31 || CONFIG_ATSAMD51_SERIAL_TX_PB31
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('B', 31)
  #define GPIO_Tx_NAME  "PB31"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PC04
  #if CONFIG_ATSAMD51_SERIAL_RX_PC04 || CONFIG_ATSAMD51_SERIAL_TX_PC04
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('C', 4)
  #define GPIO_Tx_NAME  "PC4"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PC12
  #if CONFIG_ATSAMD51_SERIAL_RX_PC12 || CONFIG_ATSAMD51_SERIAL_TX_PC12
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

