Klipper3d/klipper/src/atsamd/t5uid1/samd51_serial_pins.h
  #define GPIO_Tx       GPIO('C', 12)
  #define GPIO_Tx_NAME  "PC12"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PC13
  #if CONFIG_ATSAMD51_SERIAL_RX_PC13 || CONFIG_ATSAMD51_SERIAL_TX_PC13
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('C', 13)
  #define GPIO_Tx_NAME  "PC13"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PC16
  #if CONFIG_ATSAMD51_SERIAL_RX_PC16 || CONFIG_ATSAMD51_SERIAL_TX_PC16
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('C', 16)
  #define GPIO_Tx_NAME  "PC16"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PC17
  #if CONFIG_ATSAMD51_SERIAL_RX_PC17 || CONFIG_ATSAMD51_SERIAL_TX_PC17
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('C', 17)
  #define GPIO_Tx_NAME  "PC17"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PC22
  #if CONFIG_ATSAMD51_SERIAL_RX_PC22 || CONFIG_ATSAMD51_SERIAL_TX_PC22
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('C', 22)
  #define GPIO_Tx_NAME  "PC22"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PC23
  #if CONFIG_ATSAMD51_SERIAL_RX_PC23 || CONFIG_ATSAMD51_SERIAL_TX_PC23
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('C', 23)
  #define GPIO_Tx_NAME  "PC23"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PC27
  #if CONFIG_ATSAMD51_SERIAL_RX_PC27 || CONFIG_ATSAMD51_SERIAL_TX_PC27
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('C', 27)
  #define GPIO_Tx_NAME  "PC27"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PD08
  #if CONFIG_ATSAMD51_SERIAL_RX_PD08 || CONFIG_ATSAMD51_SERIAL_TX_PD08
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('D', 8)
  #define GPIO_Tx_NAME  "PD8"
#elif CONFIG_ATSAMD51_T5UID1_SERIAL_TX_PD09
  #if CONFIG_ATSAMD51_SERIAL_RX_PD09 || CONFIG_ATSAMD51_SERIAL_TX_PD09
    #error "The TX pin selected for the T5UID1 screen is already used"
  #endif

  #define GPIO_Tx       GPIO('D', 9)
  #define GPIO_Tx_NAME  "PD9"
#endif

#if CONFIG_ATSAMD_T5UID1_SERIAL_TX_ALT
  #define GPIO_Tx_FUNC  'D'
#else
  #define GPIO_Tx_FUNC  'C'
#endif

#define GPIO_Tx_PINOUT  0x0

#endif // samd51_serial_pins.h
